// /** @file
//   USB class code description strings
// 
// ******************************************************************************
// * Copyright 2021 - 2022 Insyde Software Corp. All Rights Reserved.
// *
// * You may not reproduce, distribute, publish, display, perform, modify, adapt,
// * transmit, broadcast, present, recite, release, license or otherwise exploit
// * any part of this publication in any form, by any means, without the prior
// * written permission of Insyde Software Corp.
// *
// ******************************************************************************
// */

/=#

#include "Standard.uni"

//
// The description strings are tuned for display in Setup Utility.
//
// To prevent end-user confusion, class codes with "undefined" standard
// meanings should replace the "undefined" text with "N/A".
//
// "|" separates one code description from another.
// If the text description comes with a short and long version, they are
// separated by ";" in this string package. The H2O USB Text Lookup Protocol
// will convert the internal ";" separator into "\r\n" for output.
// The "|" and ";" characters are chosen to minimize size overhead when text is
// encoded in SCSU. ("\t" and "\n" are not chosen because EDK II build tool can
// silently turn the two characters in .uni file to space and "\r\n".)
//

#string STR_NOT_APPLICABLE                     #language en-US "N/A"
#string STR_VENDOR_SPECIFIC                    #language en-US "Vendor Specific"
#string STR_VENDOR_SPECIFIC_RANGE              #language en-US "Vendor;Vendor Specific"

//
// USB Defined Class Codes reference:
// https://www.usb.org/defined-class-codes
//

//
// Base Class Code 00h is used differently among descriptors.
// For Device Descriptor, 00h indicates that class information should be
// determined from the Interface Descriptors.
// For Interface Descriptor, 00h is reserved.
// For Interface Association Descriptor, 00h is not allowed.
//
#string STR_USB_DEV_SUBCLASS_00_00H            #language en-US "By Interface"

//
// "USB Device Class Definition for Audio Devices"
// https://www.usb.org/document-library/usb-audio-devices-rev-30-and-adopters-agreement
//
#string STR_USB_CLASS_01H_AUDIO                #language en-US "Audio"

#string STR_USB_FUNC_SUBCLASS_01_01H           #language en-US "Full ADC 3.0"
#string STR_USB_FUNC_SUBCLASS_01_20H_TO_26H    #language en-US "Generic I/O|"
                                                               "Headphone|"
                                                               "Speaker|"
                                                               "Microphone|"
                                                               "Headset|"
                                                               "Headset Adapter|"
                                                               "Speakerphone"
#string STR_USB_INT_SUBCLASS_01_01H_TO_03H     #language en-US "AudioControl|"
                                                               "AudioStreaming|"
                                                               "MIDIStreaming"
#string STR_USB_PROTOCOL_01_00H                #language en-US "Version 1.0"
#string STR_USB_PROTOCOL_01_20H                #language en-US "Version 2.0"
#string STR_USB_PROTOCOL_01_30H                #language en-US "Version 3.0"

//
// "USB Class Definitions for Communications Devices"
// https://www.usb.org/document-library/errata-updates-cdc-v12-and-wmc-v11-dec-2012
// We include acronyms only if a specification defines them. Don't invent
// acronyms on our own.
//
#string STR_USB_CLASS_02H_COMMUNICATIONS       #language en-US "Communications;Communications Device Class"
#string STR_USB_INT_SUBCLASS_02_01H_TO_0EH     #language en-US "DLM;Direct Line Control Model (PSTN)|"
                                                               "ACM;Abstract Control Model|"
                                                               "TCM;Telephone Control Model|"
                                                               "MCM;Multi-Channel Model (ISDN)|"
                                                               "CAPI Model;Common ISDN API Control Model|"
                                                               "ECM;Ethernet Control Model|"
                                                               "ATM;Asynchronous Transfer Mode|"
                                                               "WHCM;Wireless Handset Control Model|"
                                                               "Device Management|"
                                                               "MDLM;Mobile Direct Line Model|"
                                                               "OBEX;Object Exchange|"
                                                               "EEM;Ethernet Emulation Model|"
                                                               "NCM;Network Control Model|"
                                                               "MBIM;Mobile Broadband Interface Model"
#string STR_USB_INT_PROTOCOL_02_0C_07H         #language en-US "EEM;Ethernet Emulation Model"
#string STR_USB_INT_PROTOCOL_02_01H_TO_06H     #language en-US "ITU-T V.250;AT Commands (ITU-T V.250)|"
                                                               "PCCA STD-101;AT Commands (PCCA STD-101)|"
                                                               "PCCA101-O;AT Commands (PCCA STD-101 + Annex O)|"
                                                               "GSM 07.07;AT Commands (GSM 07.07)|"
                                                               "3GPP 27.007;AT Commands (3GPP 27.007)|"
                                                               "3GPP2 C.S0017-0;AT Commands (3GPP2 C.S0017-0, for cdma2000)"
#string STR_USB_INT_PROTOCOL_02_FEH            #language en-US "External Protocol"

//
// "Device Class Definition for HID"
// https://www.usb.org/document-library/device-class-definition-hid-111
//
#string STR_USB_CLASS_03H_HID                  #language en-US "HID;Human Interface Device"

#string STR_USB_INT_SUBCLASS_03_01H            #language en-US "Boot Interface"
#string STR_USB_INT_PROTOCOL_03_01_01H_TO_02H  #language en-US "Keyboard|"
                                                               "Mouse"

//
// "USB Still Image Capture Device Definition"
// https://www.usb.org/document-library/still-image-capture-device-definition-10-and-errata-16-mar-2007
// The Device Definition document uses "PIMA 15740" when referencing the
// protocol and not "PTP" or "PIMA/ISO 15740".
//
#string STR_USB_CLASS_06H_IMAGE                #language en-US "Image"

#string STR_USB_INT_SUBCLASS_06_01H            #language en-US "Still Image;Still Image Capture Device"
#string STR_USB_INT_PROTOCOL_06_01_01H         #language en-US "PIMA 15740;PIMA 15740 (Picture Transfer Protocol)"

//
// "USB Device Class Definition for Printing Devices"
// https://www.usb.org/document-library/printer-device-class-document-11
// "USB Print Interface Class IPP Protocol Specification"
// (Defines InterfaceProtocol 04h)
// https://www.usb.org/document-library/ipp-protocol-10
//
#string STR_USB_CLASS_07H_PRINTER              #language en-US "Printer"

#string STR_USB_INT_SUBCLASS_07_01H            #language en-US "Printers"
#string STR_USB_INT_PROTOCOL_07_01_01H_TO_04H  #language en-US "Unidirectional|"
                                                               "Bi-directional|"
                                                               "IEEE 1284.4;IEEE 1284.4 Compatible Bi-directional|"
                                                               "IPP USB;Internet Printing Protocol USB Interface"

//
// "USB Mass Storage Class Specification Overview"
// https://www.usb.org/document-library/mass-storage-class-specification-overview-14
// We include acronyms only if a specification defines them. Don't invent
// acronyms on our own.
//
// CBI is "approved for use only with full-speed floppy disk drives".
// ("USB Mass Storage Class CBI Transport Specification"
// https://www.usb.org/document-library/mass-storage-controlbulkinterrupt-cbi-specification-11)
//
#string STR_USB_CLASS_08H_MASS_STORAGE         #language en-US "Mass Storage"

#string STR_USB_INT_SUBCLASS_08_01H_TO_08H     #language en-US "RBC;Reduced Block Commands (INCITS 330-2000)|"
                                                               "MMC-5 (ATAPI);MultiMedia Command Set 5 (ATAPI)|"
                                                               "QIC-157|"
                                                               "UFI;USB Floppy Interface|"
                                                               "SFF-8070i|"
                                                               "SCSI;SCSI Transparent Command Set|"
                                                               "LSD;USB Lockable Storage Device|"
                                                               "IEEE 1667"
#string STR_USB_INT_PROTOCOL_08_04_00H_TO_01H  #language en-US "CBI;Control/Bulk/Interrupt Transport|"
                                                               "CBI (no Int.);Control/Bulk/Interrupt Transport (no Interrupt endpoint)"
#string STR_USB_INT_PROTOCOL_08_50H            #language en-US "Bulk-Only;Bulk-Only Transport"
#string STR_USB_INT_PROTOCOL_08_62H            #language en-US "UAS;USB Attached SCSI"

//
// "Universal Serial Bus Specification"
//
#string STR_USB_CLASS_09H_HUB                  #language en-US "Hub"

#string STR_USB_DEV_PROTOCOL_09_00_00H         #language en-US "Full-speed"
#string STR_USB_DEV_PROTOCOL_09_00_03H         #language en-US "SuperSpeed"
#string STR_USB_PROTOCOL_09_00_01H_TO_02H      #language en-US "Single TT;Single Transaction Translator|"
                                                               "Multiple TT;Multiple Transaction Translators"
//
// "USB Class Definitions for Communications Devices"
//
#string STR_USB_CLASS_0AH_CDC_DATA             #language en-US "CDC-Data;Communications Device Class - Data Class Interface"

#string STR_USB_INT_PROTOCOL_0A_00_01_TO_02H   #language en-US "NTB;Network Transfer Block|"
                                                               "NTB-MB;Network Transfer Block (MBIM)"
#string STR_USB_INT_PROTOCOL_0A_00_30_TO_32H   #language en-US "ISDN BRI;ISDN Basic Rate Interface (ITU-T I.430)|"
                                                               "HDLC;High-level Data Link Control|"
                                                               "Transparent"
#string STR_USB_INT_PROTOCOL_0A_00_50_TO_52H   #language en-US "Q.921M;Q.921 Management|"
                                                               "Q.921|"
                                                               "Q.921TM;Q.921 TEI-multiplexer"
#string STR_USB_INT_PROTOCOL_0A_00_90_TO_93H   #language en-US "V.42bis|"
                                                               "Q.931/Euro-ISDN|"
                                                               "V.120|"
                                                               "CAPI 2.0;Common ISDN API 2.0"
#string STR_USB_INT_PROTOCOL_0A_00_FEH         #language en-US "Unit Descriptor;Protocol Unit Functional Descriptor"

//
// "Smart-Card USB Integrated Circuit(s) Card Devices"
// https://www.usb.org/sites/default/files/DWG_Smart-Card_USB-ICC_ICCD_rev10.pdf
// Not to be confused with CCID (Integrated Circuit(s) Card Interface Device).
// CCID is a "hub controller" of multiple ICCs and has a separate
// specification. CCID uses bulk transfers only (InterfaceProtocol code 00h)
// while ICCD supports InterfaceProtocol codes 00h - 02h.
//
#string STR_USB_CLASS_0BH_SMART_CARD           #language en-US "Smart Card"
#string STR_USB_INT_PROTOCOL_0B_00_00H_TO_02H  #language en-US "Bulk Transfers|"
                                                               "Version A;Version A Control Transfers|"
                                                               "Version B;Version B Control Transfers"

//
// "USB Device Class Definition for Content Security Devices"
// https://www.usb.org/document-library/device-class-definition-content-security-devices-20
// (Subclass not applicable)
//
#string STR_USB_CLASS_0DH_CONTENT_SECURITY     #language en-US "Content Security"

//
// "USB Device Class Definition for Video Devices"
// https://www.usb.org/document-library/video-class-v15-document-set
// Note: Version 1.1 specification does not define an InterfaceProtocol code
// for identifying itself. Devices compliant with Version 1.1 sets
// InterfaceProtocol to 00h ("N/A").
//
#string STR_USB_CLASS_0EH_VIDEO                #language en-US "Video"

#string STR_USB_FUNC_SUBCLASS_0E_03H           #language en-US "VIC;Video Interface Collection"
#string STR_USB_INT_SUBCLASS_0E_01H_TO_02H     #language en-US "VideoControl|"
                                                               "VideoStreaming"
#string STR_USB_INT_PROTOCOL_0E_01H            #language en-US "Version 1.5"

//
// "USB Device Class Definition for Personal Healthcare Devices"
// https://www.usb.org/document-library/personal-healthcare-rev-10
// (Subclass not applicable)
//
#string STR_USB_CLASS_0FH_PHDC                 #language en-US "PHDC;Personal Healthcare Device Class"

//
// "USB Device Class Definition for Audio/Video Devices"
// https://www.usb.org/document-library/audiovideo-device-class-v10-spec-and-adopters-agreement
//
#string STR_USB_CLASS_10H_AUDIO_VIDEO          #language en-US "Audio/Video"

#string STR_USB_INT_SUBCLASS_10_01H_TO_03H     #language en-US "AVControl|"
                                                               "AVData Video;AVData Video Streaming|"
                                                               "AVData Audio;AVData Audio Streaming"
#string STR_USB_INT_PROTOCOL_10_10H            #language en-US "Version 1.0"

//
// "USB Device Class Definition for Billboard Devices"
// https://www.usb.org/document-library/billboard-device-class-spec-revision-122-and-adopters-agreement
// (Subclass not applicable)
//
#string STR_USB_CLASS_11H_BILLBOARD            #language en-US "Billboard"

//
// "USB Type-C Bridge Class Specification"
// https://www.usb.org/document-library/usb-type-cr-bridge-specification-v11
// (Subclass not applicable)
//
#string STR_USB_CLASS_12H_TYPE_C_BRIDGE        #language en-US "USB Type-C Bridge"

//
// "USB I3C Device Class Specification"
// https://www.usb.org/document-library/usb-i3c-device-class-specification
// (Subclass not applicable)
//
#string STR_USB_CLASS_3CH_USB_I3C_DEVICE       #language en-US "USB I3C Device"

//
// Subclass specifications define class DCh as "Diagnostic".
//
// "USB2 Compliance Device"
// (Defines DeviceProtocol 01h for subclass 01h)
// https://web.archive.org/web/20110605085758/http://www.intel.com/technology/usb/spec.htm
// https://web.archive.org/web/20110403104345/http://www.intel.com/technology/usb/download/Usb2ComplianceDeviceSpec_r10.pdf
//
// "USB 3.1 Debug Class Specification for Debug Devices"
// https://www.usb.org/document-library/usb-31-debug-class-specification-debug-devices-rev-10
// Except for "GNU Remote Debug Command Set", all other Protocol codes for
// subclasses 02h - 08h either are reserved or have vendor defined usage.
//
#string STR_USB_CLASS_DCH_DIAGNOSTIC           #language en-US "Diagnostic"

#string STR_USB_DEV_SUBCLASS_DC_01H            #language en-US "Compliance;Re-programmable Compliance Device"
#string STR_USB_DEV_PROTOCOL_DC_01_01H         #language en-US "USB2 Compliance;USB2 Compliance Device"
#string STR_USB_SUBCLASS_DC_02H_TO_08H         #language en-US "DbC.GP;Debug Capability - General Purpose|"
                                                               "DbC.Dfx;Debug Capability - Dfx|"
                                                               "DbC.Trace;Debug Capability - Trace|"
                                                               "DvC.GP;Device (Debug) Capability - General Purpose|"
                                                               "DvC.Dfx;Device (Debug) Capability - Dfx|"
                                                               "DvC.Trace;Device (Debug) Capability - Trace|"
                                                               "Debug Control"
#string STR_USB_PROTOCOL_DC_02_01H_AND_05_01H  #language en-US "GNU Debug;GNU Remote Debug Command Set"

//
// Subclass specifications define class E0h as "Wireless Controller".
//
// Bluetooth Core Specification, Vol 4, Part B "USB Transport Layer",
// Section 3 "Class code"
// (Defines Protocol codes 01h and 04h for subclass 01h)
// https://www.bluetooth.com/specifications/bluetooth-core-specification/
//
// "Wireless Universal Serial Bus Specification"
// (Defines InterfaceProtocol 02h for subclass 01h, InterfaceSubClass 02h and
// Protocol codes for subclass 02h)
// https://web.archive.org/web/20180829214718/http://www.usb.org/developers/wusb/docs
// https://web.archive.org/web/20160327134049/http://www.usb.org/developers/wusb/wusb1_1_20100910.zip
// "UWB Radio Control Interface" seems to have different abbreviations among
// different but related specifications ("URC", "URCI", etc.) We choose
// "UWB RCI" so that we can spell the "Ultra-wideband" name in full.
//
#string STR_USB_CLASS_E0H_WIRELESS_CONTROLLER  #language en-US "Wireless;Wireless Controller"

#string STR_USB_SUBCLASS_E0_01H                #language en-US "RF Controller"
#string STR_USB_PROTOCOL_E0_01_01H             #language en-US "Bluetooth;Bluetooth Primary Controller"
#string STR_USB_INT_PROTOCOL_E0_01_02H         #language en-US "UWB RCI;Ultra-wideband Radio Control Interface"
#string STR_USB_PROTOCOL_E0_01_04H             #language en-US "Bluetooth AMP;Bluetooth Alternate MAC/PHY Controller"

#string STR_USB_INT_SUBCLASS_E0_02H            #language en-US "Wireless USB WA;Wireless USB Wire Adapter"
#string STR_USB_INT_PROTOCOL_E0_02_01H         #language en-US "HWA;Host Wire Adapter Control/Data Streaming"
#string STR_USB_PROTOCOL_E0_02_02H             #language en-US "DWA;Device Wire Adapter Control/Data Streaming"
#string STR_USB_INT_PROTOCOL_E0_02_03H         #language en-US "DWA Transparent;Device Wire Adapter Transparent RPipe"

//
// Subclass specifications define class EFh as "Miscellaneous".
//
// "USB Interface Association Descriptor Device Class Code and Use Model"
// (Defines DeviceProtocol 01h for subclass 02h)
// https://www.usb.org/document-library/usb-interface-association-descriptor-device-class-code-and-use-model
// "Wireless Universal Serial Bus Specification"
// (Defines DeviceProtocol 02h for subclass 02h)
//
// DVB-CI2 USB (ETSI TS 103 605)
// Section 5 "Module discovery and capabilities description"
// https://dvb.org/?standard=second-generation-common-interface-implementation-using-the-universal-serial-bus-usb
// (Defines subclass 07h and its Protocol codes)
//
#string STR_USB_CLASS_EFH_MISCELLANEOUS        #language en-US "Miscellaneous"

#string STR_USB_DEV_SUBCLASS_EF_02H            #language en-US "Common Class"
#string STR_USB_DEV_PROTOCOL_EF_02_01H_TO_02H  #language en-US "IAD;Interface Association Descriptor|"
                                                               "WAMP;Wire Adapter Multifunction Peripheral"

#string STR_USB_SUBCLASS_EF_07H                #language en-US "DVB-CI;Digital Video Broadcasting - Common Interface"
#string STR_USB_PROTOCOL_EF_07_01H             #language en-US "DVB-CI Command"
#string STR_USB_INT_PROTOCOL_EF_07_02H         #language en-US "DVB-CI Media"

//
// Subclass specifications define class FEh as "Application Specific".
//
// (InterfaceSubClass 01h) "USB Device Firmware Upgrade Specification"
// https://www.usb.org/document-library/device-firmware-upgrade-11-new-version-31-aug-2004
//
// (InterfaceSubClass 02h) "USB IrDA Bridge Device Definition"
// https://www.usb.org/document-library/irda-bridge-device-definition-10
// (Protocol code not applicable)
//
// "USB Test and Measurement Class Specification (USBTMC)"
// https://www.usb.org/document-library/test-measurement-class-specification
// Note: InterfaceSubClass 03h isn't exclusively given to USBTMC.
//
#string STR_USB_CLASS_FEH_APPLICATION          #language en-US "Application;Application Specific"

#string STR_USB_INT_SUBCLASS_FE_01H_TO_02H     #language en-US "DFU;Device Firmware Upgrade|"
                                                               "IrDA Bridge"
#string STR_USB_INT_PROTOCOL_FE_01_01H_TO_02H  #language en-US "Run-Time|"
                                                               "DFU Mode"
#string STR_USB_INT_PROTOCOL_FE_03_00H_TO_01H  #language en-US "USBTMC;USB Test and Measurement Class|"
                                                               "USBTMC USB488"
